## SQL VS Pandas

- data cleaning 
- exploring data
- analyze the data

In [73]:
import pandas as pd 
from skimpy import clean_columns

In [74]:
d={
    'name':['raed','jason','kansana','mike','ahmed','christin'],

'country':['egybt','uk','india','usa','egypt','uk'],
'Job':
['data scientist','data analyst','data scientist','data engneer',
'software engneer','data analyst']



,'age':[22,34,33,23,25,30]


}

In [75]:

dd={
'name':['raed','jason','kansana','mike','ahmed','christin'],
'Grad': [20210520,20060516,20090903,20190904,20190906,20110906]

}

In [76]:
df2=pd.DataFrame(dd)
df2

       name      Grad
0      raed  20210520
1     jason  20060516
2   kansana  20090903
3      mike  20190904
4     ahmed  20190906
5  christin  20110906

In [77]:
df=pd.DataFrame(d)
df

       name country               Job  age
0      raed   egybt    data scientist   22
1     jason      uk      data analyst   34
2   kansana   india    data scientist   33
3      mike     usa      data engneer   23
4     ahmed   egypt  software engneer   25
5  christin      uk      data analyst   30

### Cleaning

-----

1-Data quality checks

In [78]:
df.dtypes

name       object
country    object
Job        object
age         int64
dtype: object

In [79]:
df2.dtypes

name    object
Grad     int64
dtype: object

In [80]:
df.nunique()

name       6
country    5
Job        4
age        6
dtype: int64

In [81]:
df['country'].value_counts()

uk       2
egybt    1
india    1
usa      1
egypt    1
Name: country, dtype: int64

In [82]:
# is null 
df.isna().any()

name       False
country    False
Job        False
age        False
dtype: bool

In [83]:
#if rows are empty. I can drop them through the dropna() function:
#df.dropna(inplace=True, axis=0)

In [84]:
df['Job'].duplicated()

0    False
1    False
2     True
3    False
4    False
5     True
Name: Job, dtype: bool

In [85]:
df['Job']

0      data scientist
1        data analyst
2      data scientist
3        data engneer
4    software engneer
5        data analyst
Name: Job, dtype: object

In [86]:
#DataFrame_name.drop_duplicates(subset=None, keep='first', inplace=False, ignore_index=False)

The Pandas object datatype can be mixed types, with string and numeric data, but Pandas will treat it as a string.

Joining Dataframes

In [87]:
df_all_rows =  pd.merge(df, df2, how='inner', on = 'name')
df_all_rows

       name country               Job  age      Grad
0      raed   egybt    data scientist   22  20210520
1     jason      uk      data analyst   34  20060516
2   kansana   india    data scientist   33  20090903
3      mike     usa      data engneer   23  20190904
4     ahmed   egypt  software engneer   25  20190906
5  christin      uk      data analyst   30  20110906

In [88]:
clean_df = clean_columns(df_all_rows, case = 'pascal')

3 column names have been cleaned

In [89]:
clean_df

       Name Country               Job  Age      Grad
0      raed   egybt    data scientist   22  20210520
1     jason      uk      data analyst   34  20060516
2   kansana   india    data scientist   33  20090903
3      mike     usa      data engneer   23  20190904
4     ahmed   egypt  software engneer   25  20190906
5  christin      uk      data analyst   30  20110906

In [90]:
clean_df2 = clean_columns(clean_df, case = 'pascal', replace = {'job':'Occupation','Grad':'GraduationDate'})

2 column names have been cleaned

In [91]:
clean_df2

       Name Country        Occupation  Age  GraduationDate
0      raed   egybt    data scientist   22        20210520
1     jason      uk      data analyst   34        20060516
2   kansana   india    data scientist   33        20090903
3      mike     usa      data engneer   23        20190904
4     ahmed   egypt  software engneer   25        20190906
5  christin      uk      data analyst   30        20110906

formatting and Data standardization

In [92]:
list=clean_df2['GraduationDate'].tolist()

In [93]:
list

[20210520, 20060516, 20090903, 20190904, 20190906, 20110906]

In [94]:
date = pd.to_datetime(pd.Series(list))
change_format = date.dt.strftime('%d-%m-%Y')
print(change_format)

0    01-01-1970
1    01-01-1970
2    01-01-1970
3    01-01-1970
4    01-01-1970
5    01-01-1970
dtype: object

To solve this problem, you must make the data type text and not numeric

In [95]:
data=clean_df2['GraduationDate']

In [96]:
str_data=data.astype(str)

In [97]:
list=str_data.to_list()

In [98]:
list

['20210520', '20060516', '20090903', '20190904', '20190906', '20110906']

In [99]:
str_date = pd.to_datetime(pd.Series(list))
change_format = str_date.dt.strftime('%d-%m-%Y')
print(change_format)

0    20-05-2021
1    16-05-2006
2    03-09-2009
3    04-09-2019
4    06-09-2019
5    06-09-2011
dtype: object

In [100]:
df=pd.DataFrame(change_format,columns=['graduationDate'])

In [101]:
df

  graduationDate
0     20-05-2021
1     16-05-2006
2     03-09-2009
3     04-09-2019
4     06-09-2019
5     06-09-2011

In [102]:
clean_df2

       Name Country        Occupation  Age  GraduationDate
0      raed   egybt    data scientist   22        20210520
1     jason      uk      data analyst   34        20060516
2   kansana   india    data scientist   33        20090903
3      mike     usa      data engneer   23        20190904
4     ahmed   egypt  software engneer   25        20190906
5  christin      uk      data analyst   30        20110906

In [103]:
clean_df2.insert(1,'graduationDate',df)

In [104]:
del clean_df2['GraduationDate']

In [105]:

clean_df2

       Name graduationDate Country        Occupation  Age
0      raed     20-05-2021   egybt    data scientist   22
1     jason     16-05-2006      uk      data analyst   34
2   kansana     03-09-2009   india    data scientist   33
3      mike     04-09-2019     usa      data engneer   23
4     ahmed     06-09-2019   egypt  software engneer   25
5  christin     06-09-2011      uk      data analyst   30

In [106]:
df[['D','m','GraduationYear']] = clean_df2.graduationDate.str.split('-', expand=True)

In [107]:
df=df['GraduationYear']
df

0    2021
1    2006
2    2009
3    2019
4    2019
5    2011
Name: GraduationYear, dtype: object

In [108]:
clean_df2.insert(1,'GraduationYear',df)

In [109]:
clean_df2

       Name GraduationYear graduationDate Country        Occupation  Age
0      raed           2021     20-05-2021   egybt    data scientist   22
1     jason           2006     16-05-2006      uk      data analyst   34
2   kansana           2009     03-09-2009   india    data scientist   33
3      mike           2019     04-09-2019     usa      data engneer   23
4     ahmed           2019     06-09-2019   egypt  software engneer   25
5  christin           2011     06-09-2011      uk      data analyst   30

In [110]:
del clean_df2['graduationDate']

In [111]:
clean_df2

       Name GraduationYear Country        Occupation  Age
0      raed           2021   egybt    data scientist   22
1     jason           2006      uk      data analyst   34
2   kansana           2009   india    data scientist   33
3      mike           2019     usa      data engneer   23
4     ahmed           2019   egypt  software engneer   25
5  christin           2011      uk      data analyst   30

In [112]:
for x in clean_df2.index:
  if clean_df2.loc[x, "Country"]=='uk':
    clean_df2.loc[x, "Country"] = 'UK'

In [113]:
clean_df2

       Name GraduationYear Country        Occupation  Age
0      raed           2021   egybt    data scientist   22
1     jason           2006      UK      data analyst   34
2   kansana           2009   india    data scientist   33
3      mike           2019     usa      data engneer   23
4     ahmed           2019   egypt  software engneer   25
5  christin           2011      UK      data analyst   30

In [114]:
for x in clean_df2.index:
  if clean_df2.loc[x, "Country"]=='egybt':
    clean_df2.loc[x, "Country"] = 'Egypt'

  elif clean_df2.loc[x, "Country"]=='usa':
     clean_df2.loc[x, "Country"] = 'USA'

senario2

In [115]:
clean_df2

       Name GraduationYear Country        Occupation  Age
0      raed           2021   Egypt    data scientist   22
1     jason           2006      UK      data analyst   34
2   kansana           2009   india    data scientist   33
3      mike           2019     USA      data engneer   23
4     ahmed           2019   egypt  software engneer   25
5  christin           2011      UK      data analyst   30

In [116]:
cleand_df3=clean_df2.replace(['egybt','egypt'],'Egypt')

In [117]:
cleand_df3

       Name GraduationYear Country        Occupation  Age
0      raed           2021   Egypt    data scientist   22
1     jason           2006      UK      data analyst   34
2   kansana           2009   india    data scientist   33
3      mike           2019     USA      data engneer   23
4     ahmed           2019   Egypt  software engneer   25
5  christin           2011      UK      data analyst   30

In [118]:
df4=cleand_df3.replace('usa','USA')

In [119]:
df4

       Name GraduationYear Country        Occupation  Age
0      raed           2021   Egypt    data scientist   22
1     jason           2006      UK      data analyst   34
2   kansana           2009   india    data scientist   33
3      mike           2019     USA      data engneer   23
4     ahmed           2019   Egypt  software engneer   25
5  christin           2011      UK      data analyst   30

In [120]:
df_cleand=df4.replace('uk','UK')

In [121]:
df_cleand

       Name GraduationYear Country        Occupation  Age
0      raed           2021   Egypt    data scientist   22
1     jason           2006      UK      data analyst   34
2   kansana           2009   india    data scientist   33
3      mike           2019     USA      data engneer   23
4     ahmed           2019   Egypt  software engneer   25
5  christin           2011      UK      data analyst   30

-------

### Exploratory data analysis

In [122]:
from pandas_profiling import ProfileReport

In [123]:
profile = ProfileReport(df_cleand)

The library builds an HTML file, which contains all the statistics for each column, as well as calculates the correlations between each pair of numeric columns. The following figure shows an example of the produced report:

In [124]:
#profile.to_file("rainfall.html") or

In [125]:
#profile.to_notebook_iframe()

-----

### analyze the data

In [126]:
df_cleand

       Name GraduationYear Country        Occupation  Age
0      raed           2021   Egypt    data scientist   22
1     jason           2006      UK      data analyst   34
2   kansana           2009   india    data scientist   33
3      mike           2019     USA      data engneer   23
4     ahmed           2019   Egypt  software engneer   25
5  christin           2011      UK      data analyst   30

let's select all Egyptian students

In [127]:
df_cleand[df_cleand['Country']=='Egypt']

    Name GraduationYear Country        Occupation  Age
0   raed           2021   Egypt    data scientist   22
4  ahmed           2019   Egypt  software engneer   25

or we can use query()

In [128]:
df_cleand.query('Country=="Egypt"')

    Name GraduationYear Country        Occupation  Age
0   raed           2021   Egypt    data scientist   22
4  ahmed           2019   Egypt  software engneer   25

find the non-arab student

In [129]:
df_cleand.query('Country!="Egypt"')

       Name GraduationYear Country      Occupation  Age
1     jason           2006      UK    data analyst   34
2   kansana           2009   india  data scientist   33
3      mike           2019     USA    data engneer   23
5  christin           2011      UK    data analyst   30

find students home from UK or USA

In [130]:
df_cleand.query('  Country=="UK" | Country=="USA"   ')

       Name GraduationYear Country    Occupation  Age
1     jason           2006      UK  data analyst   34
3      mike           2019     USA  data engneer   23
5  christin           2011      UK  data analyst   30

occupation is that a scientist with age less than 30

In [138]:
df_cleand.query(' Occupation=="data scientist" &   Age< 30   ')

   Name GraduationYear Country      Occupation  Age
0  raed           2021   Egypt  data scientist   22

People who graduated in the good time before 2015

In [139]:
df_cleand.query(' 	GraduationYear <  "2015"  ')

       Name GraduationYear Country      Occupation  Age
1     jason           2006      UK    data analyst   34
2   kansana           2009   india  data scientist   33
5  christin           2011      UK    data analyst   30

selecting all names which start with M' letter

In [131]:
df_cleand[df_cleand['Name'].str.startswith('m')]

   Name GraduationYear Country    Occupation  Age
3  mike           2019     USA  data engneer   23

finding the pepole whose ages are between 20 and 30 years old

In [145]:
#df_cleand[ (df_cleand['Age']>=20)  &  (df_cleand['Age']<=30) ]

In [144]:
df_cleand.query('Age>20 & Age<=30')

       Name GraduationYear Country        Occupation  Age
0      raed           2021   Egypt    data scientist   22
3      mike           2019     USA      data engneer   23
4     ahmed           2019   Egypt  software engneer   25
5  christin           2011      UK      data analyst   30

finding the pepole whose job is data scientist or data analyst

In [146]:
df_cleand.query('Occupation == "data scientist" | Occupation == "data analyst"')

       Name GraduationYear Country      Occupation  Age
0      raed           2021   Egypt  data scientist   22
1     jason           2006      UK    data analyst   34
2   kansana           2009   india  data scientist   33
5  christin           2011      UK    data analyst   30

In [147]:
#df_cleand[(df_cleand.Occupation == 'data scientist') | (df_cleand.Occupation == 'data analyst') ]

finding the pepole whose job is data engneer or softwar engneer

In [134]:
df_cleand[(df_cleand.Occupation != 'data scientist') & (df_cleand.Occupation != 'data analyst') ]

    Name GraduationYear Country        Occupation  Age
3   mike           2019     USA      data engneer   23
4  ahmed           2019   Egypt  software engneer   25

Using query() With Variables

In [149]:
occupations=['data scientist','data analyst']
df_cleand.query('Occupation != @occupations ')

    Name GraduationYear Country        Occupation  Age
3   mike           2019     USA      data engneer   23
4  ahmed           2019   Egypt  software engneer   25

In [150]:
occupations=['data scientist','data analyst']
df_cleand.query('Occupation == @occupations ')

       Name GraduationYear Country      Occupation  Age
0      raed           2021   Egypt  data scientist   22
1     jason           2006      UK    data analyst   34
2   kansana           2009   india  data scientist   33
5  christin           2011      UK    data analyst   30

Rank employees based on their age in descending order

In [135]:
df_cleand.sort_values(by=['Age'], ascending=False)

       Name GraduationYear Country        Occupation  Age
1     jason           2006      UK      data analyst   34
2   kansana           2009   india    data scientist   33
5  christin           2011      UK      data analyst   30
4     ahmed           2019   Egypt  software engneer   25
3      mike           2019     USA      data engneer   23
0      raed           2021   Egypt    data scientist   22

In [156]:
df_cleand.nlargest(6,'Age')

       Name GraduationYear Country        Occupation  Age
1     jason           2006      UK      data analyst   34
2   kansana           2009   india    data scientist   33
5  christin           2011      UK      data analyst   30
4     ahmed           2019   Egypt  software engneer   25
3      mike           2019     USA      data engneer   23
0      raed           2021   Egypt    data scientist   22

In [161]:
df_cleand.nsmallest(6,'Age')

       Name GraduationYear Country        Occupation  Age
0      raed           2021   Egypt    data scientist   22
3      mike           2019     USA      data engneer   23
4     ahmed           2019   Egypt  software engneer   25
5  christin           2011      UK      data analyst   30
2   kansana           2009   india    data scientist   33
1     jason           2006      UK      data analyst   34

## pivot tables with pandas

Single Column

In [162]:
df_cleand.groupby(by='Occupation').count()

                  Name  GraduationYear  Country  Age
Occupation
data analyst         2               2        2    2
data engneer         1               1        1    1
data scientist       2               2        2    2
software engneer     1               1        1    1

multiple columns

In [163]:
df_cleand.groupby(by=['Occupation',	'Country']).count()

                          Name  GraduationYear  Age
Occupation       Country
data analyst     UK          2               2    2
data engneer     USA         1               1    1
data scientist   Egypt       1               1    1
                 india       1               1    1
software engneer Egypt       1               1    1

You can notice here that some of the data scientists are from India and some are from Egypt while the data analysts are all from UK

multiple columns and multiple aggregation

In [165]:
df_cleand.groupby(by=['Occupation',	'Country']).agg(['count','sum'])

                          Name                GraduationYear             Age  \
                         count            sum          count       sum count
Occupation       Country
data analyst     UK          2  jasonchristin              2  20062011     2
data engneer     USA         1           mike              1      2019     1
data scientist   Egypt       1           raed              1      2021     1
                 india       1        kansana              1      2009     1
software engneer Egypt       1          ahmed              1      2019     1


                         sum
Occupation       Country
data analyst     UK       64
data engneer     USA      23
data scientist   Egypt    22
                 india    33
software engneer Egypt    25

If you want to specify exactly which column to be aggregate and what aggregate to apply on it

In [167]:
agg_criteria ={'Name' : 'count', 'Age' :'mean'}

df_cleand.groupby(by=['Occupation']).agg(agg_criteria)

                  Name   Age
Occupation
data analyst         2  32.0
data engneer         1  23.0
data scientist       2  27.5
software engneer     1  25.0

### cut function

with pandas cut function you can create a different categories four columns

let us say I want to categorize the People based on their age how old they are in the field for instance anyone older than 30 will be old any one less than 30 should be Young

In [182]:
list_of_ages=df_cleand['Age'].nsmallest()
list_of_ages=list_of_ages.tolist()

In [183]:
list_of_ages

[22, 23, 25, 30, 33]

In [210]:
list=[20,29,30,40]

In [216]:
labless=['young','old','older']

In [217]:
df_cleand['categorize_Age']=pd.cut(df_cleand['Age'],bins=list,labels=labless)

In [218]:
df_cleand

       Name GraduationYear Country        Occupation  Age categorize_Age
0      raed           2021   Egypt    data scientist   22          young
1     jason           2006      UK      data analyst   34          older
2   kansana           2009   india    data scientist   33          older
3      mike           2019     USA      data engneer   23          young
4     ahmed           2019   Egypt  software engneer   25          young
5  christin           2011      UK      data analyst   30            old